{
  "name": "Jennifer Moore",
  "meta": {
    "format": "FRESH@0.6.0",
    "version": "0.1.0"
  },
  "info": {
    "label": "Software Engineer",
    "brief": "I am an experienced full stack software engineer with a demonstrated history of implementing engineering best practices across several industries. I'm most highly skilled in C#/.Net and Javascript/Node.js. I like to work on high performing teams, and I sincerely believe that continuous testing and delivery with a culture of quality and ownership are what enable that kind of performance.",
    "image": ""
  },
  "contact": {
    "website": "https://jenniferplusplus.com",
    "phone": "1-817-264-7347",
    "email": "contact@jenniferplusplus.com",
    "other": [
      "https://linkedin.com/in/jenniferplusplus"
    ]
  },
  "location": {
    "address": "",
    "city": "DFW",
    "region": "Texas",
    "code": "76021",
    "country": "US"
  },
  "social": [
    {
      "label": "",
      "network": "GitHub",
      "user": "jenniferplusplus",
      "url": "https://github.com/jenniferplusplus"
    }
  ],
  "employment": {
    "history": [
      {
        "employer": "Charles Schwab",
        "url": "http://schwab.com",
        "position": "Staff Software Engineer",
        "summary": "I joined Schwab as the technical lead for a development team in the Retail Web Technology group. During that time I worked on development tasks and provided technical guidance and leadership to the rest of the team. I subsequently moved onto another team as the lead developer for a greenfield customer facing person-to-person money transfer web app.",
        "start": "2019-08-26",
        "keywords": [
          "C#",
          "Angular",
          "IIS",
          "Web API",
          "REST",
          "Jira",
          ".Net Core",
          "TypeScript"
        ],
        "highlights": [
          "Developed internal tooling to simplify the developer workflow and speed up onboarding new developers and new applications.",
          "Maintained high standards of quality and code coverage.",
          "Developed customer facing single page apps in Angular 7 and 9.",
          "Developed middle-tier APIs in C#/.Net Core using Web API.",
          "Worked with other development teams to define dependencies and communicate application interfaces."
        ]
      },
      {
        "employer": "Solera",
        "url": "http://solera.com",
        "position": "Senior Software Engineer",
        "summary": "At Solera, I worked on customer facing products dealing with state and local laws, taxes, and fees related to vehicle sales, registration, and titling. During my time here, I have continually advocated for greater adoption of engineering best practices. I have also coordinated with other teams in designing new service oriented architectures.",
        "start": "2018-10-01",
        "end": "2019-08-16",
        "keywords": [
          "C#",
          "Azure DevOps",
          "SQL",
          "IIS",
          "WCF",
          "Web API",
          "REST",
          "Jira",
          "ASP.NET",
          "UWP"
        ],
        "highlights": [
          "Drove improvements in the development process and adoption of best practices, especially code review and unit testing.",
          "Worked on a data normalization effort to enable major code refactoring to reduce duplication.",
          "Collaborated across multiple teams to define common conventions and interfaces for REST microservices.",
          "Implemented intake and cleanup utilities for 3rd party data."
        ]
      },
      {
        "employer": "Allegro Development",
        "url": "https://www.allegrodev.com/",
        "position": "Staff Software Engineer",
        "summary": "At Allegro I led an overseas team in designing and building new features for Allegro's main product, Horizon. I also pushed to advance best practices including unit testing and DevOps.",
        "start": "2017-11-01",
        "end": "2018-09-01",
        "keywords": [
          "C#",
          "WPF",
          "WCF",
          "SQL",
          "Visual Studio",
          "TFS"
        ],
        "highlights": [
          "Designed and implemented scripting and automation features in the application. These were used by external clients to ensure data integrity and internally by QA and client services during customer onboarding.",
          "Mentored junior developers on design principles and best practices.",
          "Improved the packaging and deployment process for development builds to remove manual operations and support CI/CD efforts."
        ]
      },
      {
        "employer": "ParkHub",
        "url": "http://parkhub.com/",
        "position": "Senior Software Engineer",
        "summary": "At Parkhub, I built a new generation of services and infrastructure to allow the company to grow to provide a Global Distribution System for parking inventory and data driven insights for parking operators. I utilized IoT sensors, microservices, and mobile-first offline-first applications. We used a lightweight scrum-like methodology.",
        "start": "2017-03-01",
        "end": "2017-09-01",
        "keywords": [
          "Node.js",
          "React",
          "Redux",
          "Kafka",
          "Microservices",
          "Event Sourcing",
          "Postgres SQL",
          "Mongodb",
          "Docker",
          "Kubernetes",
          "DevOps",
          "Agile"
        ],
        "highlights": [
          "Designed and built a charting API to transform sensor based parking event data into a format that's easily visualized in graphs or charts.",
          "Contributed to the design and development of a microservices architecture based on Kafka and orchestrated with Kubernetes.",
          "Developed front end apps, primarily using React and Redux.",
          "Conducted code reviews and advocated for best practices related to testing and deployment."
        ]
      },
      {
        "employer": "Fidelity Investments",
        "url": "http://fidelity.com/",
        "position": "Senior Software Engineer",
        "summary": "As a software engineer, I contributed to the design and implementation of several customer facing and middle tier applications. I also worked to promote best practices and mentored junior team members. In this position I continued to participate in an Agile/Scrum methodology, and I worked mostly with AngularJS and NodeJS.",
        "start": "2014-06-01",
        "end": "2017-03-01",
        "keywords": [
          "Angular 1.x",
          "RxJS",
          "Protractor",
          "Selenium",
          "Node.js",
          "Express",
          "C#",
          "CI/CD",
          "Jenkins",
          "Jira",
          "DevOps",
          "Scrum",
          "REST"
        ],
        "highlights": [
          "Designed and implemented multiple projects including customer facing apps and middleware services with millions of users.",
          "Maintained greater than 90% test coverage for these projects.",
          "Worked closely with Product Owner in Scrum process to clarify requirements and adapt them to user stories.",
          "Estimated scope of stories and collaborated with the team to share work and meet sprint goals.",
          "Promoted best practices using functional techniques and MVVM design patterns.",
          "Implemented and maintained the CI/CD pipeline."
        ]
      },
      {
        "employer": "Ambit Energy",
        "url": "https://www.ambitenergy.com/",
        "position": "Software Developer",
        "summary": "During my contract at Ambit I worked on several projects to support back office and development tasks. I built internal tooling including test and automation tools used by QA and other teams.",
        "start": "2013-10-01",
        "end": "2014-06-01",
        "keywords": [
          "MS Coded UI",
          "C#",
          "Selenium",
          "SQL",
          "REST",
          "WPF",
          "JQuery",
          "Entity Framework"
        ],
        "highlights": [
          "Developed and contributed to the design of an automated test utility called Testify.",
          "Integrated with TFS for defect tracking and test case management.",
          "Created several utilities to automate common tasks for internal business users."
        ]
      }
    ],
    "ancient history": [
      {
        "employer": "Think Finance",
        "url": "https://www.thinkfinance.com/",
        "position": "QA Automation Engineer",
        "summary": "At Think Finance, I implemented an automated testing framework in C#.  This framework was used to perform full integration tests of backend systems, as well as E2E functional tests of some applications it supported.",
        "start": "2012-06-01",
        "end": "2013-06-01",
        "keywords": [
          "C#",
          "Selenium",
          "Entity Framework",
          "Fitnesse"
        ],
        "highlights": [
          "Implemented a test framework based on Selenium Webdriver.",
          "Implemented a full automated functional regression test suite for a loan application processing application."
        ]
      }
    ]
  },
  "education": {
    "degree": "no degree",
    "history": [
      {
        "institution": "University of Texas at Arlington",
        "title": "BS Software Engineering",
        "url": "http://uta.edu",
        "start": "2006-09",
        "end": "2010-06",
        "summary": "Majored in Software Engineering, did not graduate"
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Software Development",
        "level": "Expert",
        "skills": [
          "C#",
          ".Net Framework",
          "Javascript",
          "Node.js",
          "SQL",
          "Docker",
          "Kubernetes",
          "Apache Kafka",
          "React",
          "ReactiveX",
          "TDD/BDD"
        ]
      },
      {
        "name": "DevOps",
        "level": "Expert",
        "skills": [
          "Continuous Integration",
          "Jenkins",
          "Git",
          "TFS",
          "Amazon Web Services",
          "Azure DevOps"
        ]
      },
      {
        "name": "SDLC",
        "level": "Expert",
        "skills": [
          "TFS",
          "Jira",
          "Test Case Management",
          "Agile",
          "Scrum",
          "Kanban",
          "Pivotal Tracker"
        ]
      }
    ],
    "list": []
  },
  "service": {
    "summary": "",
    "history": [
      {
        "flavor": "volunteer",
        "position": "Director",
        "organization": "Women Who Code DFW",
        "url": "https://www.womenwhocode.com/dfw",
        "start": "2020-05",
        "end": "2020-10",
        "summary": "As a director, I was a member of the official leadership team for the DFW network of Women Who Code. I planned and organized monthly events; I coordinated with the hosts, sponsors, and presenters during the event; I recruited new hosts and speakers; and I helped to grow and mentor future members of the WWC DFW leadership team.",
        "highlights": [
          "Joined as a member in October 2018 and volunteered frequently.",
          "Planned and hosted a virtual discussion panel and multiple tech talks.",
          "Wrote articles for the DFW network's blog.",
          "Gave multiple tech talks.",
          "Mentored other members in professional and technical areas."
        ]
      },
      {
        "flavor": "volunteer",
        "position": "Player",
        "organization": "Dungeons & Dragons",
        "url": "https://dnd.wizards.com/",
        "start": "2000-10",
        "summary": "I've been playing and running D&D and other tabletop role playing games regularly for over 20 years. Through that hobby, I've gained a great deal of experience in working with small groups toward a common goal. Among the many skills I've learned, I feel these are particularly valuable.",
        "highlights": [
          "Quickly learning and teaching complex systems",
          "Sharing focus and responsibility with group members",
          "Finding balance between keeping focus on a goal with allowing exploration and discovery",
          "Maintaining group interest and engagement"
        ]
      }
    ],
    "ancient history": [
      {
        "flavor": "volunteer",
        "position": "General Technical Lead",
        "organization": "Women Who Code DFW",
        "url": "https://www.womenwhocode.com/dfw",
        "start": "2019-06",
        "end": "2020-05",
        "summary": "Members of Women Who Code can become Technical Leads for their chapters by active participation and support of the chapter and community.",
        "highlights": [
          "Gave multiple tech talks, <a href=\"https://jenniferplusplus.com/portfolio/\"><em>Unit Testing: How do I even?</em> and <em>Designing for Testability</em></a>",
          "Volunteered at events by greeting new members, coordinating food deliveries, and filming.",
          "Supported special events by helping with mock interviews and advising during hackathons."
        ]
      }
    ]
  }
}
